tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendDateInput(const char* label, const char* name, std::uint32_t seconds) {
    char date[16]{};
    formatDate(seconds >= kMinRealDateSeconds ? seconds : 0, date, sizeof(date));
    sendFmt("<label class='field'><span>%s</span><input type='date' name='%s' value='%s'></label>",
            label,
            name,
            date);
}

void sendCheckbox(const char* label, const char* name, bool checked) {
    sendFmt("<label class='check-field'><span class='check-title'>%s</span><span class='check-line'><input type='checkbox' name='%s' value='1'%s>启用</span></label>",
            label,
            name,
            checked ? " checked" : "");
}

void formatMonthRange(const WaterUsageSummary& summary, char* out, std::size_t len) {
    if (!out || len == 0 || summary.monthStartDay == 0 || summary.todayDay == 0) {
        return;
    }
    std::uint16_t year = 0;
    std::uint8_t month = 0;
    std::uint8_t day = 0;
    dateFromDayIndex(summary.monthStartDay, year, month, day);
    std::uint16_t endYear = 0;
    std::uint8_t endMonth = 0;
    std::uint8_t endDay = 0;
    dateFromDayIndex(summary.todayDay, endYear, endMonth, endDay);
    std::snprintf(out,
                  len,
                  "%u 月 %u ~ %u 日",
                  static_cast<unsigned>(month),
                  static_cast<unsigned>(day),
                  static_cast<unsigned>(endDay));
}

std::uint32_t maxCountVolume(const CountVolumeBucket* buckets, std::size_t count) {
    std::uint32_t max = 0;
    for (std::size_t i = 0; i < count; ++i) {
        if (buckets[i].volumeMl > max) {
            max = buckets[i].volumeMl;
        }
    }
    return max;
}

std::uint32_t maxResultCount(const std::uint32_t* values, std::size_t count) {
    std::uint32_t max = 0;
    for (std::size_t i = 0; i < count; ++i) {
        if (values[i] > max) {
            max = values[i];
        }
    }
    return max;
}

void sendUsageBar(const char* label, std::uint32_t volumeMl, std::uint32_t count, std::uint32_t maxVolume) {
    char volume[24]{};
    formatLiters(volumeMl, volume, sizeof(volume));
    const std::uint32_t percent = maxVolume == 0 ? 0 : (volumeMl * 100UL) / maxVolume;
    sendFmt("<div class='usage-row'><span>%s</span><strong>%s · %lu 次</strong>"
            "<div class='usage-bar'><i style='width:%lu%%'></i></div></div>",
            label,
            volume,
            static_cast<unsigned long>(count),
            static_cast<unsigned long>(percent));
}

void sendCountBar(const char* label, std::uint32_t count, std::uint32_t maxCount) {
    const std::uint32_t percent = maxCount == 0 ? 0 : (count * 100UL) / maxCount;
    sendFmt("<div class='usage-row'><span>%s</span><strong>%lu 次</strong>"
            "<div class='usage-bar'><i style='width:%lu%%'></i></div></div>",
            label,
            static_cast<unsigned long>(count),
            static_cast<unsigned long>(percent));
}

const char* resultLabel(std::size_t index) {
    switch (static_cast<WaterResult>(index)) {
        case WaterResult::Completed:
            return "正常完成";
        case WaterResult::StoppedByUser:
            return "用户停止";
        case WaterResult::SafetyStopped:
            return "安全停止";
        case WaterResult::FlowError:
            return "流量异常";
        case WaterResult::PauseTimeout:
            return "暂停超时";
    }
    return "未知";
}

void sendUsagePatterns(const WaterUsageSummary& summary, const SystemConfig& config) {
    Esp32BaseWeb::sendChunk("<section class='usage-panel'><h3>按预设分布</h3>");
    const std::uint32_t maxPreset = maxCountVolume(summary.presetCounts, kPresetCount);
    for (std::size_t i = 0; i < kPresetCount; ++i) {
        if (summary.presetCounts[i].count == 0) {
            continue;
        }
        char label[40]{};
        char name[kPresetNameLength]{};
        std::strncpy(name, config.presets[i].name, sizeof(name) - 1);
        std::snprintf(label, sizeof(label), "%u %s", static_cast<unsigned>(i + 1), name);
        sendUsageBar(label, summary.presetCounts[i].volumeMl, summary.presetCounts[i].count, maxPreset);
    }
    if (maxPreset == 0) {
        Esp32BaseWeb::sendChunk("<p class='hint'>最近 30 天没有可聚合的真实时间记录。</p>");
    }
    Esp32BaseWeb::sendChunk("</section><section class='usage-panel'><h3>完成结果</h3>");
    const std::uint32_t maxResult = maxResultCount(summary.resultCounts, kUsageResultCount);
    for (std::size_t i = 0; i < kUsageResultCount; ++i) {
        sendCountBar(resultLabel(i), summary.resultCounts[i], maxResult);
    }
    Esp32BaseWeb::sendChunk("</section><section class='usage-panel'><h3>单次出水分布</h3>");
    static constexpr const char* histLabels[kUsageVolumeHistCount] = {"< 0.5 L", "0.5 - 2 L", "2 - 5 L", "5 - 10 L", ">= 10 L"};
    const std::uint32_t maxHist = maxCountVolume(summary.volumeHist, kUsageVolumeHistCount);
    for (std::size_t i = 0; i < kUsageVolumeHistCount; ++i) {
        sendUsageBar(histLabels[i], summary.volumeHist[i].volumeMl, summary.volumeHist[i].count, maxHist);
    }
    Esp32BaseWeb::sendChunk("</section>");
}

void sendMachineKpi(const char* label, const char* value, bool soft = false) {
    sendFmt("<div class='machine-kpi machine-indicator%s'><span>%s</span><strong>%s</strong></div>",
            soft ? " soft" : "",
            label,
            value);
}

void sendMachineKpiId(const char* id, const char* label, const char* value, bool soft = false) {
    sendFmt("<div class='machine-kpi machine-indicator%s'><span>%s</span><strong id='%s'>%s</strong></div>",
            soft ? " soft" : "",
            label,
            id,
            value);
}

void sendMachineKpiBlock(const char* wrapperId,
                         const char* valueId,
                         const char* label,
                         const char* value,
                         bool soft = false,
                         bool hidden = false) {
    sendFmt("<div id='%s' class='machine-kpi machine-indicator%s'%s><span>%s</span><strong id='%s'>%s</strong></div>",
            wrapperId,
            soft ? " soft" : "",
            hidden ? " style='display:none'" : "",
            label,
            valueId,
            value);
}

const char* machineStatusNote(const AppSnapshot& snapshot) {
    switch (snapshot.water.state) {
        case WaterState::Idle:
            return "设备可用，等待按键启动";
        case WaterState::Confirm:
            return "等待确认，确认后开始出水";
        case WaterState::Running:
            return "正在出水，请留意容器";
        case WaterState::Paused:
            return "已暂停，等待继续或取消";
        case WaterState::Error:
            return resultText(snapshot.water.lastResult);
    }
    return "状态未知";
}

void sendMachineStatusCard(const AppSnapshot& snapshot, bool screenOn) {
    const bool shouldShowProgress = snapshot.water.state == WaterState::Running ||
                                    snapshot.water.state == WaterState::Paused ||
                                    snapshot.water.state == WaterState::Confirm;
    char targetValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        formatSecondsValue(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    } else {
        formatLiters(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    }
    char currentPreset[48]{};
    std::snprintf(currentPreset,
                  sizeof(currentPreset),
                  "%u · %s · %s",
                  static_cast<unsigned>(snapshot.water.selectedPreset + 1),
                  modeText(snapshot.water.mode),
                  targetValue);
    char outValue[24]{};
    formatLiters(snapshot.water.volumeMl, outValue, sizeof(outValue));
    const std::uint32_t progressBase = snapshot.water.mode == WaterMode::Time ? snapshot.water.elapsedSec : snapshot.water.volumeMl;
    const std::uint32_t progressPercent = percentOf(progressBase, snapshot.water.targetValue);
    char progressText[48]{};
    if (snapshot.water.mode == WaterMode::Time) {
        char elapsed[20]{};
        formatSecondsValue(snapshot.water.elapsedSec, elapsed, sizeof(elapsed));
        std::snprintf(progressText, sizeof(progressText), "%s / %s", elapsed, targetValue);
    } else {
        std::snprintf(progressText, sizeof(progressText), "%s / %s", outValue, targetValue);
    }
    const std::uint32_t remaining =
        snapshot.water.mode == WaterMode::Time
            ? (snapshot.water.targetValue > snapshot.water.elapsedSec ? snapshot.water.targetValue - snapshot.water.elapsedSec : 0)
            : (snapshot.water.targetValue > snapshot.water.volumeMl ? snapshot.water.targetValue - snapshot.water.volumeMl : 0);
    char remainingValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        formatSecondsValue(remaining, remainingValue, sizeof(remainingValue));
    } else {
        formatLiters(remaining, remainingValue, sizeof(remainingValue));
    }
    char elapsedValue[24]{};
    formatSecondsValue(snapshot.water.elapsedSec, elapsedValue, sizeof(elapsedValue));
    char pulsePerLiter[24]{};
    if (snapshot.pulsePerLiter > 0) {
        std::snprintf(pulsePerLiter, sizeof(pulsePerLiter), "%lu 脉冲/L", static_cast<unsigned long>(snapshot.pulsePerLiter));
    } else {
        std::snprintf(pulsePerLiter, sizeof(pulsePerLiter), "未校准");
    }
    char droppedPulses[24]{};
    std::snprintf(droppedPulses, sizeof(droppedPulses), "%lu", static_cast<unsigned long>(snapshot.flowDroppedPulses));

    const bool showRemaining = snapshot.water.state == WaterState::Running || snapshot.water.state == WaterState::Paused ||
                               snapshot.water.state == WaterState::Confirm;
    const bool showElapsed = snapshot.water.state == WaterState::Running || snapshot.water.state == WaterState::Paused;
    const bool showResult = snapshot.water.state == WaterState::Error || snapshot.localMode == LocalUiMode::Result;
    const char* machineLayoutClass = shouldShowProgress ? "machine-main" : "machine-main compact";
    sendFmt("<h2>机器状态</h2><section class='panel machine-status'><div class='%s'><div class='machine-hero'>"
            "<span class='machine-eyebrow'>当前状态</span><strong>",
            machineLayoutClass);
    Esp32BaseWeb::sendChunk("<span id='machineState'>");
    Esp32BaseWeb::sendChunk(stateText(snapshot.water.state));
    sendFmt("</span></strong><p id='machineStatusNote' class='machine-note'>%s</p>"
            "<p class='machine-preset-line'>当前预设 <span id='machinePreset'>%s</span></p>",
            machineStatusNote(snapshot),
            currentPreset);
    sendFmt("<div id='machineProgress' class='machine-progress'%s><div class='machine-progress-head'><span>出水进度</span><strong id='machineProgressText'>%s</strong></div>"
            "<div class='progress'><span id='machineProgressBar' style='width:%lu%%'></span></div></div>",
            shouldShowProgress ? "" : " style='display:none'",
            progressText,
            static_cast<unsigned long>(progressPercent));
    Esp32BaseWeb::sendChunk("</div><div class='machine-kpis'>");
    sendMachineKpiId("targetValue", "目标值", targetValue);
    sendMachineKpiId("outputValue", "已出水", outValue);
    sendMachineKpiBlock("kpiRemaining",
                        "remainingValue",
                        snapshot.water.mode == WaterMode::Time ? "剩余时间" : "剩余量",
                        remainingValue,
                        false,
                        !showRemaining);
    sendMachineKpiBlock("kpiElapsed", "elapsedValue", "已运行", elapsedValue, false, !showElapsed);
    sendMachineKpiBlock("kpiResult", "resultStatus", "结束原因", resultText(snapshot.water.lastResult), false, !showResult);
    sendMachineKpiId("valveStatus", "阀门", snapshot.water.valveOpen ? "开" : "关");
    sendMachineKpiId("pulsePerLiter", "流量计校准系数", pulsePerLiter, true);
    if (snapshot.flowDroppedPulses > 0) {
        sendMachineKpi("丢弃脉冲", droppedPulses, true);
    }
    sendMachineKpiId("screenStatus", "屏幕状态", screenOn ? "亮屏" : "休眠", true);
    Esp32BaseWeb::sendChunk("</div></div></section>");
}

TodayOverview collectTodayOverview(std::uint32_t now, std::uint32_t fallbackTodayMl) {
    TodayOverview overview{};
    overview.volumeMl = fallbackTodayMl;
    if (!g_context.records || !g_context.records->ready() || now < kMinRealDateSeconds || waterTaskActive()) {
        return overview;
    }
    overview.timeReady = true;
    const std::uint32_t todayStart = (now / 86400UL) * 86400UL;
    WaterRecord records[kDefaultRecordPageSize]{};
    const std::size_t total = g_context.records->count();
    bool stopAfterPage = false;
    for (std::size_t offset = 0; offset < total && !stopAfterPage; offset += kDefaultRecordPageSize) {
        const std::size_t page = offset / kDefaultRecordPageSize;
        const std::size_t read = g_context.records->readPage(page, kDefaultRecordPageSize, records, kDefaultRecordPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (!waterRecordHasRealTime(records[i])) {
                continue;
            }
            if (records[i].startTime > now) {
                continue;
            }
            if (records[i].startTime < todayStart) {
                stopAfterPage = true;
                break;
            }
            ++overview.count;
            if (overview.latestCount < kHomeTodayRecordLimit) {
                overview.latest[overview.latestCount++] = records[i];
            }
        }
    }
    return overview;
}

